#1
#сгенерировать объект Series, содержащий 100 000 чисел с плавающей точкой,
#принадлежащих нормальному распределению со средним значением, равным нулю,
#и стандартным отклонением, равным 100

#2
#получите для этого набора данных показатели описательной статистики.
#Насколько близки к друг другу оказались среднее значение и медиана?
#Вам не нужно вычислять разницу между ними, просто прикиньте глазами,
#почему они не равны

#3
#замените минимальное значение в наборе данных числом, в пять раз
#превышающим максимальное

#4
#снова извлеките показатели описательной статистики.
#Изменились ли среднее значение, медиана и стандартное отклонение?
#Никаких рачетов проводить не нужно, достаточно зрительного анализа. Если изменили, то почему?


import pandas as pd
import numpy as np

g = np.random.default_rng(0)
s = pd.Series(g.normal(0, 100, 100_000))
s.loc[s == s.min()] = 5*s.max()
desc = s.describe() # вывод описательной статистики

print(desc)

# Упражнение 4.1
# В рамках одного стандартного отклонения
one_std = s[(s > s.min() - s.std()) & (s < s.mean() + s.std())].count() / s.count()
print(one_std)

# В рамках двух стандартных отклонений
two_std = s[(s > s.min() - 2 * s.std()) & (s < s.mean() + 2 * s.std())].count() / s.count()
print(two_std)

# В рамках трех стандартных отклонений
three_std = s[(s > s.min() - 3 * s.std()) & (s < s.mean() + 3 * s.std())].count() / s.count()
print(three_std)

# Упражнение 4.2
mean_calc = (s[s < s.mean()].mean() + s[s > s.mean()].mean()) / 2
print(mean_calc)
print(s.mean())

# Упражнение 4.3
# Комбинация индексов - масок, но результатом будет объект Series, у которого мы можем посчитать среднее
avg_masks = s[(s < s.mean() - 3*s.std())|
              (s > s.mean() + 3*s.std())].mean()
print(avg_masks)




